#Задача 10. Да се състави програма, която изчислява сумата на произведенията 
#от 1 до въведено едноцифрено число, като броя на числата в редицата е до числото n*2
#Сумата се формира така:
#1*2 + 2*3*4 +..+n*(n+1)*(n+2)*..*2*n

sum = 0
n = 4
for i in range(1,n + 1): #правим цикъл за n пъти(затова е n  + 1)
    res = 1 #това е резултата от произведението на числата
    for j in range(i, (2 * i) + 1): #правим втори цикъл, който умножава числата, които са до 2 пъти първото в реда число
        #(*2*n), за 1 ред 1х2, за втори ред - 2х2(до 4, което е последното в редицата (2х3х4)), за трети ред 3х2(до 6, последно число (3х4х5х6)) и така до числото n)
        # в случая(4х5х6х7х8)
        res *= j #тук се получават произведенията от числата в съответния ред
    sum += res #сумираме произведенията
print(sum)

