# Задача 13. Да се състави програма, чрез която се извежда квадрат от цифри. Сумите от
# елементите на произволен ред или стълб са равни на 45.
# Пример:
# 1 2 3 4 5 6 7 8 9 0
# 2 3 4 5 6 7 8 9 0 1
# 3 4 5 6 7 8 9 0 1 2
# 4 5 6 7 8 9 0 1 2 3
# 5 6 7 8 9 0 1 2 3 4
# 6 7 8 9 0 1 2 3 4 5
# 7 8 9 0 1 2 3 4 5 6
# 8 9 0 1 2 3 4 5 6 7
# 9 0 1 2 3 4 5 6 7 8
# 0 1 2 3 4 5 6 7 8 9


for i in range(1,11):
    for j in range(i,i+10):
        print(j%10,end=" ")
        
    print()

