#Задача 4. Да се напише програма, която да обръща буквите на дадена дума на обратно.
#Думата да бъде въведена от клавиатурата. Като за целта използвате цикъл.

word = input('Write word: ')
for i in reversed(word):
    
    print(i, end='')
