#Задача 8. Да се принтира буквата A на екрана както е дадено по-долу:

for i in range(1,8):
    if i == 1:
        print('','***','')
    elif i == 4:
        print('*****')
    else:
        print('*',' ', '*')