'''Задача 10. Да се напише програма, която да пресмята лицето на кръг при зададен радиус r.'''

r = 10
f_circle = 3.14*int(r**2)/4
print(f_circle)