'''Задача 9. Да се пресметне питагоровата теорема a2 + b2 = c2  
при зададени стойности на a, b и c.'''

a = 3
b = 4
c = 5
c2 = 5**2
b2 = 4**2
a2 = 3**2
c2 = b2 + a2
print(c2)