"""Задача 5. Да се изчисли лицето на триъгълник, 
като неговата височина е 13.66, а срещуположната страна 245.54 см."""

h = 13.66
b = 245.54
f = b*h/2
print(f)