'''Задача 7. Декларирайте две променливи, които да са цели числа. 
Задайте им стойности съответно 5 и 10. 
Разменете стойностите им и ги отпечатайте.'''

a = 5
b = 10
c = b
b = a
a = c
print(a, b)