'''Задача 8. Напишете програма, която за дадени дължина и височина на успоредник, 
пресмята и отпечатва на конзолата неговия периметър и лице.'''

l = 6
h = 8
p = 4*l
f = h*l
print("Perimeter is:",p, "and area is:",f)