#Задача 1. Да се напише if-конструкция, която проверява стойността на две целочислени
#променливи и разменя техните стойности, ако стойността на първата променлива е по-голяма
#от втората.

a =  5 #int(input('Enter digit: '))
b =  3#int(input('Enter digit: '))

if a > b:
    c = a 
    a = b
    b = c
    print(a, b)
