#Задача 8. Напишете програма, която преобразува дадено число в интервала [0..999] в текст,
#съответстващ на българското произношение. Примери:
#-0 -> “Нула”
#-273 -> ”Двеста седемдесет и три”
#-400 -> ”Четиристотин”
#-501 -> “Петстотин и едно”
#-711 -> “Седемстотин и единадесет”

a = '','едно', 'две', 'три', 'четири', 'пет', 'шест', 'седем', 'осем', 'девет'
b = 'десет','единадесет', 'дванадесет', 'тринадесет', 'четиринадесет', 'петнадесет', 'шестнадесет', 'седемнадесет', 'осемнадесет', 'деветнадесет'
c =  '', '','двадесет', 'тридесет', 'четиридесет', 'петдесет', 'шестдесет', 'седемдесет', 'осемдесет', 'деветдесет'
d = '','сто', 'двеста', 'триста', 'четиристотин', 'петстотин', 'шестстотин', 'седемстотин', 'осемстотин', 'деветстотин'

x = int(input('Write digit between 0 and 1000: '))
if x == 0 or x >= 1000:
    print('Error')
elif x < 10:
    print(a[x])
elif x < 20 and x > 9:
    print(b[x%10])
elif x < 100 and x > 19:
    print(c[x//10], 'и', a[x%10])

elif x == 100 or x == 200 or x == 300 or x == 400 or x == 500 or x == 600 or x == 700 or x == 800 or x ==900:
    print(d[x//100]) 


elif x < 110 and x > 100: 
    print(d[x//100],'и', a[x%10])
elif x < 210 and x > 200:
    print(d[x//100],'и', a[x%10])
elif x < 320 and x > 300:
    print(d[x//100],'и', a[x%10])
elif x < 420 and x > 400:
    print(d[x//100],'и', a[x%10])
elif x < 520 and x > 500:
    print(d[x//100],'и', a[x%10])
elif x < 620 and x > 600:
    print(d[x//100],'и', a[x%10])
elif x < 720 and x > 700:
    print(d[x//100],'и', a[x%10])
elif x < 820 and x > 800:
    print(d[x//100],'и', a[x%10])
elif x < 920 and x > 900:
    print(d[x//100],'и', a[x%10])


elif x < 120 and x > 109: 
    print(d[x//100],'и', b[x%10])
elif x < 220 and x > 209:
    print(d[x//100],'и', b[x%10])
elif x < 320 and x > 309:
    print(d[x//100],'и', b[x%10])
elif x < 420 and x > 409:
    print(d[x//100],'и', b[x%10])
elif x < 520 and x > 509:
    print(d[x//100],'и', b[x%10])
elif x < 620 and x > 609:
    print(d[x//100],'и', b[x%10])
elif x < 720 and x > 709:
    print(d[x//100],'и', b[x%10])
elif x < 820 and x > 809:
    print(d[x//100],'и', b[x%10])
elif x < 920 and x > 909:
    print(d[x//100],'и', b[x%10])

else:
    print(d[x//100], c[x%100//10], a[x%10])

